<font size = '5'><b>Filtering and Ordering in SQL</b><font>

In [1]:
import pandas as pd
import numpy as np
import sqlite3
conn = sqlite3.connect('pets_database.db')
cur = conn.cursor()

In [2]:
cur.execute("""SELECT * FROM cats
               ORDER BY age DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(6)

   id      name   age               breed  owner_id
0   4       Moe  10.0               Tabby       NaN
1   3  Lil' Bub   5.0  American Shorthair       NaN
2   1      Maru   3.0       Scottish Fold       1.0
3   5   Patches   2.0              Calico       NaN
4   2      Hana   1.0               Tabby       1.0
5   6      None   NaN               Tabby       NaN

In [3]:
df.shape

(6, 5)

If you wanted to only get the details of the oldest cat, you can do it by using LIMIT:

In [4]:
cur.execute("""SELECT * FROM cats
               ORDER BY age DESC
               LIMIT 1;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id name  age  breed owner_id
0   4  Moe   10  Tabby     None

For the youngest cart, just change the ORDER BY to ASC and that should do the trick...lets try it out:

In [5]:
cur.execute("""SELECT * FROM cats
               ORDER BY age ASC
               LIMIT 1;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id  name   age  breed owner_id
0   6  None  None  Tabby     None

In [8]:
cur.execute("""SELECT * FROM cats
               ORDER BY age ASC
               LIMIT 1;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id  name   age  breed owner_id
0   6  None  None  Tabby     None

<b>Using the option WHERE</b>

In [9]:
cur.execute("""SELECT * FROM cats
               WHERE age BETWEEN 1 AND 3
               ORDER BY age DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id     name  age          breed  owner_id
0   1     Maru    3  Scottish Fold       1.0
1   5  Patches    2         Calico       NaN
2   2     Hana    1          Tabby       1.0

As you might have realized, some cats, or one cat, has no name. You can find out about these cases (Null) by using the <b>NULL</b> option:

In [11]:
cur.execute("""SELECT * FROM cats
               WHERE name IS null;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id  name   age  breed owner_id
0   6  None  None  Tabby     None

Some really useful things that can be do with SQL, is using aggregates functions such as <b>COUNT</b>. These functions can get you the average of a column's values, retrieve the minimum and maximum values of a column, sum values in a column, or count a number of records that meet certain conditions. For the time being lets just use <b>COUNT</b>

In [14]:
cur.execute("""SELECT COUNT(owner_id) 
               FROM cats
               WHERE owner_id = 1;""").fetchall()
#df = pd.DataFrame(cur.fetchall())
#df.columns = [x[0] for x in cur.description]
#df.head()

[(2,)]

Another aggregate function that is very useful is the <b>GROUP BY</b>

In [20]:
cur.execute("""SELECT breed, owner_id, COUNT(breed) 
               FROM cats
               GROUP BY breed
               ORDER BY breed DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

                breed  owner_id  COUNT(breed)
0               Tabby       1.0             3
1       Scottish Fold       1.0             1
2              Calico       NaN             1
3  American Shorthair       NaN             1